<a href="https://colab.research.google.com/github/thiagosouf/datascience/blob/master/dataScience01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#inserindo dados artificiais
data = {"Birth": ["","10/02/2000","10/02/2000","10/02/1988","10/02/1990","10/02/1995","10/02/1995","10/02/2002","10/02/1970"],
        "Age": [1000,20,20,32,30,25,35,18,50],
        "Sex":["","m","M","Male","m","f","F",np.nan,"F"],
        "Job": ["","Arts & Design","Arts & Design","Business","busines","Healthcare","Healthcare","Food","@#4"],
        "Income": ["<50k","<50k","<50k",">50k",">50k",">50k","<50k","<50k",">50k"]}

In [ ]:
#convertendo dicionario para DataFrame
df = pd.DataFrame(data)

In [ ]:
#visualizando o dataframe
df

        Birth   Age   Sex            Job Income
0              1000                        <50k
1  10/02/2000    20     m  Arts & Design   <50k
2  10/02/2000    20     M  Arts & Design   <50k
3  10/02/1988    32  Male       Business   >50k
4  10/02/1990    30     m        busines   >50k
5  10/02/1995    25     f     Healthcare   >50k
6  10/02/1995    35     F     Healthcare   <50k
7  10/02/2002    18   NaN           Food   <50k
8  10/02/1970    50     F            @#4   >50k

In [ ]:
#dropando coluna
df.drop(["Birth"],axis=1,inplace=True) # apagando a coluna "Birth" no eixo=1 (por coluna). inplace significa para apagar do dataset corrente e não gerar uma cópia.

In [ ]:

df

    Age   Sex            Job Income
0  1000                        <50k
1    20     m  Arts & Design   <50k
2    20     M  Arts & Design   <50k
3    32  Male       Business   >50k
4    30     m        busines   >50k
5    25     f     Healthcare   >50k
6    35     F     Healthcare   <50k
7    18   NaN           Food   <50k
8    50     F            @#4   >50k

In [ ]:
#Descobrindo inconsistencias
df.Sex.unique() #valores unicos da coluna Sex

array(['', 'm', 'M', 'Male', 'f', 'F', nan], dtype=object)

In [ ]:
#substituindo valores inconsistentes
df.Sex.replace('m','M',inplace=True)
df.Sex.replace('Male','M',inplace=True)
df.Sex.replace('f','F',inplace=True)

In [ ]:
df

    Age  Sex            Job Income
0  1000                       <50k
1    20    M  Arts & Design   <50k
2    20    M  Arts & Design   <50k
3    32    M       Business   >50k
4    30    M        busines   >50k
5    25    F     Healthcare   >50k
6    35    F     Healthcare   <50k
7    18  NaN           Food   <50k
8    50    F            @#4   >50k

In [ ]:
#buscar os valores unicos da coluna Job
df.Job.unique()

array(['', 'Arts & Design', 'Business', 'busines', 'Healthcare', 'Food',
       '@#4'], dtype=object)

In [ ]:
#subistitui na coluna Job(valor antigo,valor novo)
df.Job.replace('busines','Business',inplace=True)

In [ ]:
df

    Age  Sex            Job Income
0  1000                       <50k
1    20    M  Arts & Design   <50k
2    20    M  Arts & Design   <50k
3    32    M       Business   >50k
4    30    M       Business   >50k
5    25    F     Healthcare   >50k
6    35    F     Healthcare   <50k
7    18  NaN           Food   <50k
8    50    F            @#4   >50k

In [ ]:
#dropa linha 0
df.drop(0,inplace=True)

In [ ]:
df

   Age  Sex            Job Income
1   20    M  Arts & Design   <50k
2   20    M  Arts & Design   <50k
3   32    M       Business   >50k
4   30    M       Business   >50k
5   25    F     Healthcare   >50k
6   35    F     Healthcare   <50k
7   18  NaN           Food   <50k
8   50    F            @#4   >50k

In [ ]:
df.Job.replace('@#4',np.nan,inplace=True)

In [ ]:
df

   Age  Sex            Job Income
1   20    M  Arts & Design   <50k
2   20    M  Arts & Design   <50k
3   32    M       Business   >50k
4   30    M       Business   >50k
5   25    F     Healthcare   >50k
6   35    F     Healthcare   <50k
7   18  NaN           Food   <50k
8   50    F            NaN   >50k

In [ ]:
#Verificando se existe duplicatas na tabela
df[df.duplicated(keep=False)] #o que esta dentro retorna um booleano dos indices duplicados, colocando um df fora ele imprime a tabela

   Age Sex            Job Income
1   20   M  Arts & Design   <50k
2   20   M  Arts & Design   <50k

In [ ]:
#df.drop(1,inplace=True) #exclui uma linha especifica
#ou
df = df[False == df.duplicated(keep='first')] #exclui todos os repetidos e mantem somente o primeiro

In [ ]:
df

   Age  Sex            Job Income
1   20    M  Arts & Design   <50k
3   32    M       Business   >50k
4   30    M       Business   >50k
5   25    F     Healthcare   >50k
6   35    F     Healthcare   <50k
7   18  NaN           Food   <50k
8   50    F            NaN   >50k

In [ ]:
df.Age <=40 #filtra todas as idedaes menores de 40 anos

1     True
3     True
4     True
5     True
6     True
7     True
8    False
Name: Age, dtype: bool

In [ ]:
df.Job != 'Food' #filtra todos os Jobs diferentes de Food

1     True
3     True
4     True
5     True
6     True
7    False
8     True
Name: Job, dtype: bool

In [ ]:
df = df[df.Age <= 40] #aplicando filtro de Idade

In [ ]:
df = df[df.Job != "Food"] #aplicando filtro de Job

In [ ]:
df

   Age Sex            Job Income
1   20   M  Arts & Design   <50k
3   32   M       Business   >50k
4   30   M       Business   >50k
5   25   F     Healthcare   >50k
6   35   F     Healthcare   <50k